Returns an array of indices of all registered results
  Namespace:   Autodesk.Revit.DB.Analysis
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2012
 Syntax
  C#
public IList<int> GetRegisteredResults()
  Visual Basic
Public Function GetRegisteredResults As IList(Of Integer)
  Visual C++
public:
IList<int>^ GetRegisteredResults()
 See Also
  SpatialFieldManager Class
  Autodesk.Revit.DB.Analysis Namespace